Revit 2027 API
PointOnEdgeEdgeIntersection.GetEdgeReference2 Method
Get a copy of the second edge or curve reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetEdgeReference2()
Public Function GetEdgeReference2 As Reference
public:
Reference^ GetEdgeReference2()
member GetEdgeReference2 : unit -> Reference
Return Value
Reference
See Also
Reference
PointOnEdgeEdgeIntersection Class
Autodesk.Revit.DB Namespace